#+TITLE: Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ~/.emacs.d/init.el
** performance
 
#+begin_src emacs-lisp
    ;; -*- lexical-binding: t; -*-
  (gcmh-mode 1)
    ;; The default is 800 kilobytes.  Measured in bytes.
    ;; Profile emacs startup
    (add-hook 'emacs-startup-hook
  	    (lambda ()
  	      (message "*** Emacs loaded in %s seconds with %d garbage collections."
  		       (emacs-init-time "%.2f")
  		       gcs-done)))
 
#+end_src
 
#+RESULTS:
| (lambda nil (message *** Emacs loaded in %s seconds with %d garbage collections. (emacs-init-time %.2f) gcs-done)) | #[0 \301!\210eb\210\302 \210\303\304!\207 [dashboard-buffer-name switch-to-buffer redisplay run-hooks dashboard-after-initialize-hook] 2] | (closure (t) nil (message *** Emacs loaded in %s seconds with %d garbage collections. (emacs-init-time %.2f) gcs-done)) |
 
 
** Native compilation
 
#+begin_src emacs-lisp
 
  ;; Silence compiler warnings as they can be pretty disruptive
  (setq native-comp-async-report-warnings-errors nil)
 
  ;; Set the right directory to store the native comp cache
  (add-to-list 'native-comp-eln-load-path (expand-file-name "eln-cache/" user-emacs-directory))
 
#+end_src
 
#+RESULTS:
| /home/karim/.cache/emacs/eln-cache/ | /home/karim/.emacs.d/eln-cache/ | /home/karim/.guix-profile/lib/emacs/native-site-lisp | /gnu/store/3bsvi1gvbacnpbxrv6v1334d2d256766-emacs-29.3/lib/emacs/29.3/native-lisp/ |
** doom code
#+begin_src emacs-lisp
  (defmacro cmds! (&rest branches)
  "Returns a dispatcher that runs the a command in BRANCHES.
Meant to be used as a target for keybinds (e.g. with `define-key' or `map!').
 
BRANCHES is a flat list of CONDITION COMMAND pairs. CONDITION is a lisp form
that is evaluated when (and each time) the dispatcher is invoked. If it returns
non-nil, COMMAND is invoked, otherwise it falls through to the next pair.
 
The last element of BRANCHES can be a COMMANd with no CONDITION. This acts as
the fallback if all other conditions fail.
 
Otherwise, Emacs will fall through the keybind and search the next keymap for a
keybind (as if this keybind never existed).
 
See `general-key-dispatch' for what other arguments it accepts in BRANCHES."
  (declare (doc-string 1))
  (let ((docstring (if (stringp (car branches)) (pop branches) ""))
        fallback)
    (when (cl-oddp (length branches))
      (setq fallback (car (last branches))
            branches (butlast branches)))
    (let ((defs (cl-loop for (key value) on branches by 'cddr
                         unless (keywordp key)
                         collect (list key value))))
      `'(menu-item
         ,(or docstring "") nil
         :filter (lambda (&optional _)
                   (let (it)
                     (cond ,@(mapcar (lambda (pred-def)
                                       `((setq it ,(car pred-def))
                                         ,(cadr pred-def)))
                                     defs)
                           (t ,fallback))))))))
 
#+end_src
 
#+RESULTS:
: cmds!
 
*** :pkg
 
The =:pkg= keyword will depend on Guix-installed Emacs packages unless
the parameter seems like a =straight.el= recipe (it's a list).
 
#+begin_src emacs-lisp
 
  ;; Recipe is always a list
  ;; Install via Guix if length == 1 or :guix t is present
 
  (defvar dw/guix-emacs-packages '()
    "Contains a list of all Emacs package names that must be
  installed via Guix.")
 
  ;; Examples:
  ;; - (org-roam :straight t)
  ;; - (git-gutter :straight git-gutter-fringe)
 
  (defun dw/filter-straight-recipe (recipe)
    (let* ((plist (cdr recipe))
           (name (plist-get plist :straight)))
      (cons (if (and name (not (equal name t)))
                name
              (car recipe))
            (plist-put plist :straight nil))))
 
  (setup-define :pkg
    (lambda (&rest recipe)
      (if (and t
               (or (eq (length recipe) 1)
                   (plist-get (cdr recipe) :guix)))
          `(add-to-list 'dw/guix-emacs-packages
                        ,(or (plist-get recipe :guix)
                             (concat "emacs-" (symbol-name (car recipe)))))
        `(straight-use-package ',(dw/filter-straight-recipe recipe))))
    :documentation "Install RECIPE via Guix or straight.el"
    :shorthand #'cadr)
 
#+end_src

#+RESULTS:
| &rest | sexp |
 
*** :delay
 
Delay the loading of a package until a certain amount of idle time has passed.
 
#+begin_src emacs-lisp
 
  (setup-define :delay
     (lambda (&rest time)
       `(run-with-idle-timer ,(or time 1)
                             nil ;; Don't repeat
                             (lambda () (require ',(setup-get 'feature)))))
     :documentation "Delay loading the feature until a certain amount of idle time has passed.")
 
#+end_src

#+RESULTS:
| &rest | sexp |
 
*** :disabled
 
Used to disable a package configuration, similar to =:disabled= in =use-package=.
 
#+begin_src emacs-lisp
 
  (setup-define :disabled
    (lambda ()
      `,(setup-quit))
    :documentation "Always stop evaluating the body.")
 
#+end_src

#+RESULTS:
| &rest | sexp |
 
*** :load-after
 
This keyword causes a body to be executed after other packages/features are loaded:
 
#+begin_src emacs-lisp
 
  (setup-define :load-after
      (lambda (features &rest body)
        (let ((body `(progn
                       (require ',(setup-get 'feature))
                       ,@body)))
          (dolist (feature (if (listp features)
                               (nreverse features)
                             (list features)))
            (setq body `(with-eval-after-load ',feature ,body)))
          body))
    :documentation "Load the current feature after FEATURES."
    :indent 1)
 
#+end_src

#+RESULTS:
| &rest | sexp |
 
Transitioning to setup.el for a more streamlined configuration.
 
#+begin_src emacs-lisp
(straight-use-package '(setup :type git :host nil :repo "https://git.sr.ht/~pkal/setup"))
(require 'setup)
;; Uncomment the following for debugging
;; (defun dw/log-require (&rest args)
;;   (with-current-buffer (get-buffer-create "*require-log*")
;;     (insert (format "%s\n" (file-name-nondirectory (car args))))))
;; (add-to-list 'after-load-functions #'dw/log-require)
#+end_src

#+RESULTS:
: setup
 
 
Defining custom keywords like :pkg, :delay, :disabled, and :load-after for tailored package management and loading.
 
#+begin_src emacs-lisp
;; Definitions for :pkg, :delay, :disabled, and :load-after go here
#+end_src

#+RESULTS:
 
** org babel
#+begin_src emacs-lisp :noweb yes
  (setup (:pkg org :straight t))
  <<babel-packages>>
  (org-babel-do-load-languages
   'org-babel-load-languages
   (quote (
  	     (shell . t)
           (python . t)
           (ditaa . t)
           (gnuplot . t)
           (fsharp . t)
           (restclient . t)
  	     (powershell . t)
           (http . t))))


#+end_src
 
#+RESULTS:
 
#+name:babel-packages
#+begin_src emacs-lisp 
  (setup (:pkg ob-powershell :host github :repo "rkiggen/ob-powershell"))
  (setup (:pkg ob-fsharp :straigth t))
  (setup (:pkg ob-restclient :straigth t))
  (use-package ob-http)
  ;; (setup (:pkg ob-async :straight t))
  (require 'ob-powershell)
  (require 'ob-fsharp)
  ;; (require 'ob-async)
#+end_src

#+RESULTS: babel-packages
: ob-fsharp
 
#+begin_src sh
  sleep 3 && echo "Hello World"
#+end_src

#+RESULTS:
: Hello World
 
** Winner-mode
#+begin_src emacs-lisp
  (setq winner-mode 1)
#+end_src

#+RESULTS:
: 1
  (global-set-key [remap dabbrev-expand] 'hippie-expand)
  (use-package nerd-icons
    :ensure t)

  (use-package nerd-icons-completion
    :ensure t
    :after marginalia
    :config
    (nerd-icons-completion-marginalia-setup)
    (nerd-icons-completion-mode 1))

  (use-package nerd-icons-corfu
    :ensure t
    :after corfu
    :config
    (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))

** Puni (structural editing - sexp / balanced expressions)
#+begin_src emacs-lisp
  ;; Install and configure Puni
(use-package puni
  :init
  ;; Enable puni-mode globally
  (puni-global-mode)
  :config
  ;; Define keybindings similar to Paredit
  (define-key puni-mode-map (kbd "C-M-f") 'puni-forward-sexp)
  (define-key puni-mode-map (kbd "C-M-b") 'puni-backward-sexp)
  (define-key puni-mode-map (kbd "C-M-u") 'backward-up-list)
  (define-key puni-mode-map (kbd "C-M-d") 'down-list)
  (define-key puni-mode-map (kbd "C-M-p") 'backward-up-list)
  (define-key puni-mode-map (kbd "C-M-n") 'up-list)
  (define-key puni-mode-map (kbd "C-k") 'puni-kill-line)
  (define-key puni-mode-map (kbd "M-(") 'puni-syntactic-backward-punct)
  (define-key puni-mode-map (kbd "M-)") 'puni-syntactic-forward-punct)
  (define-key puni-mode-map (kbd "M-[") 'puni-wrap-square)
  (define-key puni-mode-map (kbd "M-{") 'puni-wrap-curly)
  (define-key puni-mode-map (kbd "M-s") 'puni-splice)
  (define-key puni-mode-map (kbd "M-S") 'puni-split)
  (define-key puni-mode-map (kbd "M-J") 'puni-join)
  (define-key puni-mode-map (kbd "M-r") 'puni-raise)
  (define-key puni-mode-map (kbd "C-)") 'puni-slurp-forward)
  (define-key puni-mode-map (kbd "C-(") 'puni-slurp-backward)
  (define-key puni-mode-map (kbd "C->") 'puni-syntactic-forward-punct)
  (define-key puni-mode-map (kbd "C-<") 'puni-syntactic-backward-punct)
  (define-key puni-mode-map (kbd "C-}") 'puni-barf-forward)
  (define-key puni-mode-map (kbd "C-{") 'puni-barf-backward))

;; Optionally, disable Puni in term-mode
(add-hook 'term-mode-hook #'puni-disable-puni-mode)

#+end_src

#+RESULTS:
| puni-disable-puni-mode |

*** Templating (TempEL, Yasnippet)
 
#+begin_src emacs-lisp
  ;;         (setup (:pkg tempel)
  ;;           )
  ;;         (setup (:pkg tempel-collection :load-after tempel))
  ;;     ;; (:option tempel-trigger-prefix ">")
  ;;       (defun tempel-setup-capf ()
  ;;           ;; Add the Tempel Capf to `completion-at-point-functions'.
  ;;           ;; `tempel-expand' only triggers on exact matches. Alternatively use
  ;;           ;; `tempel-complete' if you want to see all matches, but then you
  ;;           ;; should also configure `tempel-trigger-prefix', such that Tempel
  ;;           ;; does not trigger too often when you don't expect it. NOTE: We add
  ;;           ;; `tempel-expand' *before* the main programming mode Capf, such
  ;;           ;; that it will be tried first.
  ;;           (setq-local completion-at-point-functions
  ;;                       (cons #'tempel-complete
  ;;                             completion-at-point-functions)))
 
  ;; (with-eval-after-load 'tempel
  ;;      ;; Ensure tempel-path is a list -- it may also be a string.
  ;;      (unless (listp 'tempel-path)
  ;;        (setq tempel-path (list tempel-path)))
  ;;      (add-to-list 'tempel-path "~/src/guix/etc/snippets/tempel/*"))
 
  ;;       (add-to-list 'completion-at-point-functions 'tempel-setup-capf)
  ;;         (add-hook 'conf-mode-hook 'tempel-setup-capf)
  ;;         (add-hook 'prog-mode-hook 'tempel-setup-capf)
  ;;         (add-hook 'text-mode-hook 'tempel-setup-capf)
 
#+end_src
 
 
#+begin_src emacs-lisp
  (setup (:pkg yasnippet))
  (require 'yasnippet)
  (yas-global-mode 1)
#+end_src
#+RESULTS:
| emacs-yasnippet | emacs-wgrep | emacs-paredit | emacs-sly | emacs-embark | emacs-kind-icon | emacs-all-the-icons-dired | emacs-guix | emacs-editorconfig | emacs-transient | emacs-org-modern | emacs-magit | emacs-orderless | emacs-flycheck | emacs-marginalia | emacs-consult | emacs-eros | emacs-aggressive-indent | emacs-vertico-posframe | emacs-vertico | emacs-tempel | emacs-cape | emacs-corfu | emacs-doom-modeline | emacs-doom-themes | emacs-which-key | emacs-diminish | emacs-no-littering |
 
*Guix packages*
 
#+begin_src scheme :noweb-ref packages :noweb-sep ""
  ;; "emacs-tempel"
  ;; "emacs-tempel-collection"
  ;; "emacs-eglot-tempel"
"emacs-yasnippet"
"emacs-auto-yasnippet"
"emacs-yasnippet-snippets"
#+end_src
 
 
** csharp / fsharp
#+begin_src emacs-lisp
  (setup (:pkg sharper :host github :repo "sebasmonia/sharper")
    (require 'sharper))

  (global-set-key (kbd "C-c d") 'sharper-main-transient)

  ;; (defun my-csharp-mode-setup ()
  ;;   (set-buffer-file-coding-system 'unix))

  ;; (add-hook 'csharp-mode-hook 'my-csharp-mode-setup)

  (require 'web-mode)

  ;; Associate .cshtml files with web-mode
  (add-to-list 'auto-mode-alist '("\\.cshtml\\'" . web-mode))

  ;; Customize web-mode settings for .cshtml files
  (defun my-web-mode-hook ()
    "Hooks for Web mode."
    ;; Enable indentation
    (setq web-mode-markup-indent-offset 2)
    (setq web-mode-code-indent-offset 2)
    (setq web-mode-css-indent-offset 2))

      ;;Define key remap for lsp-mode
  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :hook ((csharp-mode . lsp-deferred)
           ;; (fsharp-mode . lsp-deferred)
           )
    :config
    (define-key lsp-mode-map [remap xref-find-apropos] #'consult-lsp-symbols)
    (setq lsp-prefer-capf t))  ;; Optional: Configure lsp-mode to use completion-at-point-functions

  ;; Configure lsp-consult
  (use-package consult-lsp
    :commands consult-lsp-symbols
    :commands consult-lsp-diagnostics)

  ;; Ensure csharp-mode is installed and required
  (use-package csharp-mode
    ;; :mode "\\.cs\\'"
    :hook (csharp-mode . lsp-deferred))

  ;; Ensure fsharp-mode is  installed and required
  (use-package fsharp-mode)
  (add-hook 'web-mode-hook 'my-web-mode-hook)
  (add-hook 'eglot-managed-mode-hook (lambda () (+lsp-optimization-mode t)))
  (use-package eglot-fsharp)


#+end_src
 
#+RESULTS:
| (lambda nil (+lsp-optimization-mode t)) | +lsp-optimization-mode | (closure (bootstrap-version t) nil (eglot-inlay-hints-mode -1)) | (closure (bootstrap-version t) nil (+lsp-optimization-mode t)) | doom-modeline-override-eglot | doom-modeline-update-eglot |
 
 
#+begin_src emacs-lisp
#+end_src
** consult
 
#+begin_src emacs-lisp
        (setup (:pkg consult)
          (setq consult-project-root-function #'doom-project-root
            consult-narrow-key "<"
            consult-line-numbers-widen t
            consult-async-min-input 2
            consult-async-refresh-delay  0.15
            consult-async-input-throttle 0.2
            consult-async-input-debounce 0.1))
      (global-unset-key (kbd "C-x C-b"))
      (global-unset-key (kbd "C-h C-f"))
      
  (require 'consult)
  (consult-customize
   consult-ripgrep consult-git-grep consult-grep
   consult-bookmark consult-recent-file consult-xref
   consult--source-bookmark consult--source-file-register
   consult--source-recent-file consult--source-project-recent-file
   ;; my/command-wrapping-consult    ;; disable auto previews inside my command
   :preview-key '(:debounce 0.4 any)) ;; Option 1: Delay preview
    (transient-define-prefix my-register-menu ()
      "Transient for registers."
      ["Registers"
       ("s" "Store to Register" consult-register-store)
       ("r" "View/Register Actions" consult-register)])

#+end_src
 
#+RESULTS:
| [1 transient-column (:description Registers) ((1 transient-suffix (:key s :description Store to Register :command consult-register-store)) (1 transient-suffix (:key r :description View/Register Actions :command consult-register)))] |
 
*Guix Packages*
#+begin_src scheme :noweb-ref packages :noweb-sep ""
 
  "emacs-consult"
  "emacs-consult-eglot"
#+end_src
 
** Occur
#+begin_src emacs-lisp
        (setup (:pkg occurx-mode :straight t))
 
#+end_src
 
#+RESULTS:
| [1 transient-column (:description Registers) ((1 transient-suffix (:key s :description Store to Register :command consult-register-store)) (1 transient-suffix (:key r :description View/Register Actions :command consult-register)))] |
 
*Guix Packages*
#+begin_src scheme :noweb-ref packages :noweb-sep ""
 
#+end_src
 
** Version control
[[https://magit.vc/][Magit]] is one of emacs best features. It's been around forever at it has truly helped me understand the intricasies of git.
 
if this isn't you cup of tea and you're on windows or mac, then I highly recommend [[https://magit.vc/][Fork]]
#+begin_src emacs-lisp
      (setup (:pkg magit)
        (:also-load magit-todos)
        (:option magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))
   
      (meow-leader-define-key
       '("v " . my-git-commands))
      ;; Function to display magit status in a full frame
      (setq magit-display-buffer-function #'magit-display-buffer-fullframe-status-v1)
      (setq magit-save-repository-buffers 'dontask)
   
  (setq ediff-window-setup-function 'ediff-setup-windows-plain)
   
      (transient-define-prefix my-git-commands ()
        "A transient for common git operations."
        ["Git Commands"
         ["Magit"
          ("g" "Status" magit-status)
          ("b" "blame" magit-blame-addition)
          ("C" "Clone" magit-clone)
          ]
         ["Timemachine"
          ("t" "Toggle Timemachine" git-timemachine-toggle)]])
#+end_src
 
#+RESULTS:
| [1 transient-columns (:description Git Commands) ([1 transient-column (:description Magit) ((1 transient-suffix (:key s :description Status :command magit-status)) (1 transient-suffix (:key c :description Commit :command magit-commit)) (1 transient-suffix (:key b :description blame :command magit-blame-addition)) (1 transient-suffix (:key b :description Branches :command magit-branch)))] [1 transient-column (:description Timemachine) ((1 transient-suffix (:key t :description Toggle Timemachine :command git-timemachine-toggle)))])] |
 
*Guix Packages*
 
#+begin_src scheme :noweb-ref packages :noweb-sep ""
  "emacs-magit"
  "emacs-diff-hl"
  "emacs-magit-todos"
  "emacs-git-timemachine"
#+end_src
 
** Org modern 
#+begin_src emacs-lisp
  (setup (:pkg org-modern))
  (setq org-modern-table nil)
   (add-hook 'org-mode-hook 'org-modern-mode)
   (add-hook 'org-agenda-finalize-hook 'org-modern-agenda)
#+end_src
 
#+RESULTS:
| org-modern-agenda | org-agenda-property-add-properties |
 
*Guix packages*
#+begin_src scheme :noweb-ref packages :noweb-sep ""
"emacs-org-modern"
#+end_src
** tabspaces
like perps-mode, perps.el and perspective.el but simpler and utilizing the built in tab-bar-mode
 
#+begin_src emacs-lisp
    (setup (:pkg tabspaces :host github :repo "mclear-tools/tabspaces")
      (tabspaces-mode 1)
      (:option tabspaces-use-filtered-buffers-as-default t
               tabspaces-default-tab "Default"
               tabspaces-remove-to-default t
               tabspaces-include-buffers '("*scratch*")
               tabspaces-initialize-project-with-todo t
               tabspaces-todo-file-name "project-todo.org"
               ;; sessions
               tabspaces-session t))
  (transient-define-prefix tabspaces-transient ()
    "TabSpaces: Manage workspaces and buffers"
    [["Buffer Management"
      ("k" "Kill buffers & close ws" tabspaces-kill-buffers-close-workspace)
      ("c" "Clear buffers" tabspaces-clear-buffers)
      ("d" "Remove ted buffer" tabspaces-remove-selected-buffer)]
     ["Workspace Management"
      ("w" "Close workspace" tabspaces-close-workspace)
      ("s" "Switch/Create workspace" tabspaces-switch-or-create-workspace)
      ("o" "Open/Create project/ws" tabspaces-open-or-create-project-and-workspace)]
     ["Buffer Navigation"
      ("b" "Switch buffer" tabspaces-switch-to-buffer)
      ("t" "Switch buffer & tab" tabspaces-switch-buffer-and-tab)]])
 
    ;; Filter Buffers for Consult-Buffer
 
    (with-eval-after-load 'consult
      ;; hide full buffer list (still available with "b" prefix)
      (consult-customize consult--source-buffer :hidden t :default nil)
      ;; set consult-workspace buffer list
      (defvar consult--source-workspace
        (list :name     "Workspace Buffers"
              :narrow   ?w
              :history  'buffer-name-history
              :category 'buffer
              :state    #'consult--buffer-state
              :default  t
              :items    (lambda () (consult--buffer-query
                                    :predicate #'tabspaces--local-buffer-p
                                    :sort 'visibility
                                    :as #'buffer-name)))
 
        "Set workspace buffer list for consult-buffer.")
      (add-to-list 'consult-buffer-sources 'consult--source-workspace))
 
#+end_src
 
#+RESULTS:
| consult--source-workspace | consult--source-hidden-buffer | consult--source-modified-buffer | consult--source-buffer | consult--source-recent-file | consult--source-file-register | consult--source-bookmark | consult--source-project-buffer-hidden | consult--source-project-recent-file-hidden |
 
** wgrep
makes grep buffers writeable.
#+begin_src emacs-lisp
    (setup (:pkg wgrep))
    #+end_src
 
#+RESULTS:
| emacs-wgrep | emacs-paredit | emacs-sly | emacs-embark | emacs-kind-icon | emacs-all-the-icons-dired | emacs-guix | emacs-editorconfig | emacs-transient | emacs-org-modern | emacs-magit | emacs-orderless | emacs-flycheck | emacs-marginalia | emacs-consult | emacs-eros | emacs-aggressive-indent | emacs-vertico | emacs-yasnippet | emacs-cape | emacs-corfu | emacs-doom-modeline | emacs-doom-themes | emacs-which-key | emacs-diminish | emacs-no-littering |
 
*Guix packages*
#+begin_src scheme :noweb-ref packages :noweb-sep ""
  "emacs-wgrep"
  #+end_src
** Common Lisp
#+begin_src emacs-lisp
        ;; (setup (:pkg sly))
        (setup (:pkg paredit))
  (use-package slime
    :ensure t
    :config
    (setq inferior-lisp-program "sbcl")
    (setq slime-contribs '(slime-fancy))
    (slime-setup '(slime-fancy)))

    ;; (setq inferior-lisp-program "sbcl")
     ;; (setq sly-lisp-implementations
     ;;       '((sbcl ("sbcl" "--dynamic-space-size" "4Gb"))))
    ;; Enable paredit for Common Lisp programming
    (add-hook 'lisp-mode-hook #'enable-paredit-mode)
     
    ;; Enable paredit for Emacs Lisp programming
    (add-hook 'emacs-lisp-mode-hook #'enable-paredit-mode)
     
    ;; Enable paredit for Scheme programming
    (add-hook 'scheme-mode-hook #'enable-paredit-mode)
    ;; Enable paredit for Scheme programming
    (add-hook 'scheme-mode-hook #'enable-paredit-mode)

    ;; Enable paredit for Common Lisp programming
    (add-hook 'lisp-mode-hook #'aggressive-indent-mode)

    ;; Enable paredit for Emacs Lisp programming
    (add-hook 'emacs-lisp-mode-hook #'aggressive-indent-mode)

    ;; Enable paredit for Scheme programming
    (add-hook 'scheme-mode-hook #'aggressive-indent-mode)
    ;; Enable paredit for Scheme programming
    (add-hook 'scheme-mode-hook #'aggressive-indent-mode)
#+end_src
 
#+RESULTS:
| aggressive-indent-mode | enable-paredit-mode | geiser-mode--maybe-activate |
 
*Guix packages*
#+begin_src scheme :noweb-ref packages :noweb-sep ""
  "emacs-sly"
  "emacs-sly-quicklisp"
  "emacs-paredit"
  "sbcl"
   #+end_src

